In [1]:
import pandas as pd
import numpy as np
import datetime
import sklearn

In [2]:
# Postulantes
postulantes = pd.read_csv('./data/postulantes_encoding_01.csv',\
                          low_memory=False)

# Avisos
avisos = pd.read_csv('./data/avisos_encoding_01.csv', \
                     low_memory=False)

# Transacciones
merged = pd.read_csv('./data/merged_encoding_01.csv', \
                     low_memory=False)

In [3]:
postulantes.count()

Unnamed: 0         504407
idpostulante       504407
sexo               504407
edad               504407
estado             504407
nivel_alcanzado    504407
dtype: int64

In [4]:
del postulantes['Unnamed: 0']

In [5]:
postulantes.head()

  idpostulante  sexo  edad  estado  nivel_alcanzado
0         NM5M     1  47.0     2.0              1.0
1         5awk     1  55.0     2.0              3.0
2         ZaO5     1  39.0     0.0              3.0
3         NdJl     2  49.0     1.0              4.0
4         eo2p     2  37.0     2.0              4.0

In [6]:
avisos.count()

Unnamed: 0              25288
idaviso                 25288
nombre_zona             25288
tipo_de_trabajo         25288
nivel_laboral           25288
nombre_area             25288
denominacion_empresa    25288
dtype: int64

In [7]:
del avisos['Unnamed: 0']
avisos.head()

,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,8725750,1,1,1,0,4005
1,17903700,1,1,1,7,1640
2,1000150677,0,1,1,4,1561
3,1000610287,1,1,1,4,4119
4,1000872556,1,1,1,5,1267

In [8]:
avisos_g = avisos
while len(avisos_g) < 504407:
    avisos_g = pd.concat([avisos_g, avisos])

In [9]:
avisos_g.count()

idaviso                 505760
nombre_zona             505760
tipo_de_trabajo         505760
nivel_laboral           505760
nombre_area             505760
denominacion_empresa    505760
dtype: int64

In [10]:
avisos_g = avisos_g[:504407]
avisos_g = sklearn.utils.shuffle(avisos_g)
avisos_g.count()

idaviso                 504407
nombre_zona             504407
tipo_de_trabajo         504407
nivel_laboral           504407
nombre_area             504407
denominacion_empresa    504407
dtype: int64

In [11]:
avisos_g = avisos_g.reset_index().drop('index',axis=1)

In [12]:
a_y_p = pd.concat([postulantes, avisos_g], axis = 1)
a_y_p.head()

,idpostulante,sexo,edad,estado,nivel_alcanzado,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,NM5M,1,47.0,2.0,1.0,1112463968,1,1,1,8,2917
1,5awk,1,55.0,2.0,3.0,1112512286,1,1,0,8,1544
2,ZaO5,1,39.0,0.0,3.0,1112386835,1,1,1,0,4175
3,NdJl,2,49.0,1.0,4.0,1112302805,1,1,1,8,1936
4,eo2p,2,37.0,2.0,4.0,1112273762,1,1,1,8,3552

In [13]:
del merged['Unnamed: 0']
merged.head()

,idaviso,idpostulante,sexo,edad,estado,nivel_alcanzado,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,1112257047,NM5M,1,47.0,2.0,1.0,1,0,3,3,1369
1,1112257047,1kJqGb,1,34.0,1.0,3.0,1,0,3,3,1369
2,1112257047,eOE9Rr,1,39.0,0.0,3.0,1,0,3,3,1369
3,1112257047,Zrx8Xz,1,39.0,2.0,2.0,1,0,3,3,1369
4,1112257047,ZrKNQY,1,32.0,1.0,3.0,1,0,3,3,1369

Excluimos las combinaciones de avisos y postulantes que estén en el data frame de postulaciones, de manera tal que nos queden las "no postulaciones".

In [14]:
a_y_p = a_y_p.drop(pd.merge(a_y_p,merged,\
    how='inner',on=['idpostulante','idaviso']).index,axis=0)
a_y_p.count()

idpostulante            504119
sexo                    504119
edad                    504119
estado                  504119
nivel_alcanzado         504119
idaviso                 504119
nombre_zona             504119
tipo_de_trabajo         504119
nivel_laboral           504119
nombre_area             504119
denominacion_empresa    504119
dtype: int64

In [15]:
a_y_p['sepostulo'] = 0
a_y_p.head(2)

,idpostulante,sexo,edad,estado,nivel_alcanzado,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa,sepostulo
288,6VEEO,2,38.0,1.0,4.0,1112192417,0,1,1,0,1813,0
289,ezqvj,2,42.0,2.0,4.0,1112305381,1,1,0,0,3737,0

In [16]:
merged['sepostulo'] = 1
merged.count()

idaviso                 7742942
idpostulante            7742942
sexo                    7742942
edad                    7742942
estado                  7742942
nivel_alcanzado         7742942
nombre_zona             7742942
tipo_de_trabajo         7742942
nivel_laboral           7742942
nombre_area             7742942
denominacion_empresa    7742942
sepostulo               7742942
dtype: int64

In [17]:
train_data = pd.concat([a_y_p, merged])
train_data.count()

denominacion_empresa    8247061
edad                    8247061
estado                  8247061
idaviso                 8247061
idpostulante            8247061
nivel_alcanzado         8247061
nivel_laboral           8247061
nombre_area             8247061
nombre_zona             8247061
sepostulo               8247061
sexo                    8247061
tipo_de_trabajo         8247061
dtype: int64

In [18]:
train_data.head()

,denominacion_empresa,edad,estado,idaviso,idpostulante,nivel_alcanzado,nivel_laboral,nombre_area,nombre_zona,sepostulo,sexo,tipo_de_trabajo
288,1813,38.0,1.0,1112192417,6VEEO,4.0,1,0,0,0,2,1
289,3737,42.0,2.0,1112305381,ezqvj,4.0,0,0,1,0,2,1
290,34,35.0,1.0,1112396786,aXAaD,4.0,1,5,1,0,1,1
291,936,41.0,0.0,1112295726,5RPVG,3.0,1,3,1,0,2,1
292,3737,59.0,2.0,1112260219,NDkr4,3.0,0,5,1,0,2,1

In [19]:
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import accuracy_score
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder
from collections import defaultdict

In [20]:
X = train_data[['denominacion_empresa','edad','estado','nivel_alcanzado'\
                ,'nivel_laboral','nombre_area','nombre_zona','sexo','tipo_de_trabajo']]
Y = train_data['sepostulo']

In [21]:
X_train, X_test, y_train, y_test = \
    train_test_split(X, Y, test_size=0.10, random_state=7506)

In [22]:
print("Tamaño de X:\t\t", len(X), "\nTamaño de X_train:\t", \
      len(X_train), "\nTamaño de X_test:\t", len(X_test), \
      "\n\nTamaño de y:\t\t", len(Y), "\nTamaño de y_train:\t",\
      len(y_train), "\nTamaño de y_test:\t", len(y_test))

Tamaño de X:		 8247061
Tamaño de X_train:	 7422354
Tamaño de X_test:	 824707

Tamaño de y:		 8247061
Tamaño de y_train:	 7422354
Tamaño de y_test:	 824707

In [23]:
# Instanciamos el clasificador KNN con 5 vecinos.
knn = KNeighborsClassifier(n_neighbors=5)

In [24]:
knn.fit(X_train, y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
           metric_params=None, n_jobs=1, n_neighbors=5, p=2,
           weights='uniform')

In [27]:
import winsound
def play_beep():
    duration = 500  # millisecond
    freq = 480  # Hz
    winsound.Beep(freq, duration)
play_beep()

In [26]:
# Probamos la precisión con el set de prueba
precision = round(knn.score(X_test, y_test) * 100, 2)
print(precision)

94.25

In [28]:
test_final = pd.read_csv('./data/test_final_100k.csv', low_memory=False)
test_final.head()

   id  idaviso idpostulante
0   0   739260       6M9ZQR
1   1   739260       6v1xdL
2   2   739260       ezRKm9
3   3   758580       1Q35ej
4   4   758580       EAN4J6

In [29]:
a_predecir = pd.merge(test_final, postulantes, on = 'idpostulante', how = 'left')
a_predecir.count()

id                 100000
idaviso            100000
idpostulante       100000
sexo               100000
edad               100000
estado             100000
nivel_alcanzado    100000
dtype: int64

In [30]:
a_predecir = pd.merge(a_predecir, avisos, on = 'idaviso', how = 'left')
a_predecir.count()

id                      100000
idaviso                 100000
idpostulante            100000
sexo                    100000
edad                    100000
estado                  100000
nivel_alcanzado         100000
nombre_zona             100000
tipo_de_trabajo         100000
nivel_laboral           100000
nombre_area             100000
denominacion_empresa    100000
dtype: int64

In [31]:
a_predecir.head()

,id,idaviso,idpostulante,sexo,edad,estado,nivel_alcanzado,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,0,739260,6M9ZQR,1,34.0,2.0,4.0,0,1,2,0,465
1,1,739260,6v1xdL,2,30.0,2.0,2.0,0,1,2,0,465
2,2,739260,ezRKm9,1,26.0,2.0,3.0,0,1,2,0,465
3,3,758580,1Q35ej,2,31.0,2.0,4.0,0,1,3,8,3895
4,4,758580,EAN4J6,1,53.0,0.0,3.0,0,1,3,8,3895

In [32]:
del a_predecir['id']
del a_predecir['idaviso']
del a_predecir['idpostulante']
array_a_predecir = a_predecir.values

In [33]:
probabilidades = []
predicciones = []
for x in array_a_predecir:
    #y_pred = knn.predict([x])
    #predicciones.append(y_pred)
    #print("Prediccion: " + str(y_pred))
    y_proba = knn.predict_proba([x])
    #print("Probabilidad de Acierto: " + str(round(y_proba[0][y_pred][0]* 100, 2))+"%")
    probabilidades.append(y_proba)

In [38]:
prob_post = []
for p in probabilidades:
    prob_post.append(p[0][1])

In [39]:
submit = pd.concat([test_final, pd.DataFrame(data = prob_post, \
                                             columns = ['sepostulo'])],axis=1)
submit.head()

   id  idaviso idpostulante  sepostulo
0   0   739260       6M9ZQR        0.0
1   1   739260       6v1xdL        0.6
2   2   739260       ezRKm9        0.0
3   3   758580       1Q35ej        0.2
4   4   758580       EAN4J6        0.0

In [40]:
del submit['idaviso']
del submit['idpostulante']

In [41]:
submit.set_index('id', inplace = True)
submit.head()

    sepostulo
id
0         0.0
1         0.6
2         0.0
3         0.2
4         0.0

In [42]:
submit.to_csv('./data/submitKnn01.csv', encoding='utf-8')

In [14]:
submit_average['sepostulo'] = submit_average \
    .apply(lambda x: (x.sepostulo_x + x.sepostulo_y) / 2, axis=1)

In [15]:
submit_average.head()

   id  sepostulo_x  sepostulo_y  sepostulo
0   0     0.910578     0.902338   0.906458
1   1     0.924300     0.917158   0.920729
2   2     0.926396     0.922226   0.924311
3   3     0.910578     0.902338   0.906458
4   4     0.849675     0.832367   0.841021

In [16]:
del submit_average['sepostulo_x']
del submit_average['sepostulo_y']
submit_average.head()

   id  sepostulo
0   0   0.906458
1   1   0.920729
2   2   0.924311
3   3   0.906458
4   4   0.841021

In [17]:
submit_average.set_index('id', inplace = True)
submit_average.head(2)

    sepostulo
id
0    0.906458
1    0.920729

In [18]:
submit_average.to_csv('./data/submit_ave2.csv', encoding='utf-8')